MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECH064/mcu.h
extern volatile __OFF016bits_t OFF016bits __asm__ ("OFF016") __attribute__((section("sfrs"), address(0xBF810580)));
#define OFF017 OFF017
extern volatile uint32_t   OFF017 __attribute__((section("sfrs"), address(0xBF810584)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF017bits_t;
extern volatile __OFF017bits_t OFF017bits __asm__ ("OFF017") __attribute__((section("sfrs"), address(0xBF810584)));
#define OFF018 OFF018
extern volatile uint32_t   OFF018 __attribute__((section("sfrs"), address(0xBF810588)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF018bits_t;
extern volatile __OFF018bits_t OFF018bits __asm__ ("OFF018") __attribute__((section("sfrs"), address(0xBF810588)));
#define OFF019 OFF019
extern volatile uint32_t   OFF019 __attribute__((section("sfrs"), address(0xBF81058C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF019bits_t;
extern volatile __OFF019bits_t OFF019bits __asm__ ("OFF019") __attribute__((section("sfrs"), address(0xBF81058C)));
#define OFF020 OFF020
extern volatile uint32_t   OFF020 __attribute__((section("sfrs"), address(0xBF810590)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF020bits_t;
extern volatile __OFF020bits_t OFF020bits __asm__ ("OFF020") __attribute__((section("sfrs"), address(0xBF810590)));
#define OFF021 OFF021
extern volatile uint32_t   OFF021 __attribute__((section("sfrs"), address(0xBF810594)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF021bits_t;
extern volatile __OFF021bits_t OFF021bits __asm__ ("OFF021") __attribute__((section("sfrs"), address(0xBF810594)));
#define OFF022 OFF022
extern volatile uint32_t   OFF022 __attribute__((section("sfrs"), address(0xBF810598)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF022bits_t;
extern volatile __OFF022bits_t OFF022bits __asm__ ("OFF022") __attribute__((section("sfrs"), address(0xBF810598)));
#define OFF023 OFF023
extern volatile uint32_t   OFF023 __attribute__((section("sfrs"), address(0xBF81059C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF023bits_t;
extern volatile __OFF023bits_t OFF023bits __asm__ ("OFF023") __attribute__((section("sfrs"), address(0xBF81059C)));
#define OFF024 OFF024
extern volatile uint32_t   OFF024 __attribute__((section("sfrs"), address(0xBF8105A0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF024bits_t;
extern volatile __OFF024bits_t OFF024bits __asm__ ("OFF024") __attribute__((section("sfrs"), address(0xBF8105A0)));
#define OFF025 OFF025
extern volatile uint32_t   OFF025 __attribute__((section("sfrs"), address(0xBF8105A4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF025bits_t;
extern volatile __OFF025bits_t OFF025bits __asm__ ("OFF025") __attribute__((section("sfrs"), address(0xBF8105A4)));
#define OFF026 OFF026
extern volatile uint32_t   OFF026 __attribute__((section("sfrs"), address(0xBF8105A8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF026bits_t;
extern volatile __OFF026bits_t OFF026bits __asm__ ("OFF026") __attribute__((section("sfrs"), address(0xBF8105A8)));
#define OFF027 OFF027
extern volatile uint32_t   OFF027 __attribute__((section("sfrs"), address(0xBF8105AC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF027bits_t;
extern volatile __OFF027bits_t OFF027bits __asm__ ("OFF027") __attribute__((section("sfrs"), address(0xBF8105AC)));
#define OFF028 OFF028
extern volatile uint32_t   OFF028 __attribute__((section("sfrs"), address(0xBF8105B0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF028bits_t;
extern volatile __OFF028bits_t OFF028bits __asm__ ("OFF028") __attribute__((section("sfrs"), address(0xBF8105B0)));
#define OFF029 OFF029
extern volatile uint32_t   OFF029 __attribute__((section("sfrs"), address(0xBF8105B4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF029bits_t;
extern volatile __OFF029bits_t OFF029bits __asm__ ("OFF029") __attribute__((section("sfrs"), address(0xBF8105B4)));
#define OFF030 OFF030
extern volatile uint32_t   OFF030 __attribute__((section("sfrs"), address(0xBF8105B8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF030bits_t;
extern volatile __OFF030bits_t OFF030bits __asm__ ("OFF030") __attribute__((section("sfrs"), address(0xBF8105B8)));
#define OFF031 OFF031
extern volatile uint32_t   OFF031 __attribute__((section("sfrs"), address(0xBF8105BC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF031bits_t;
extern volatile __OFF031bits_t OFF031bits __asm__ ("OFF031") __attribute__((section("sfrs"), address(0xBF8105BC)));
#define OFF032 OFF032
extern volatile uint32_t   OFF032 __attribute__((section("sfrs"), address(0xBF8105C0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF032bits_t;
extern volatile __OFF032bits_t OFF032bits __asm__ ("OFF032") __attribute__((section("sfrs"), address(0xBF8105C0)));
#define OFF033 OFF033
extern volatile uint32_t   OFF033 __attribute__((section("sfrs"), address(0xBF8105C4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF033bits_t;
extern volatile __OFF033bits_t OFF033bits __asm__ ("OFF033") __attribute__((section("sfrs"), address(0xBF8105C4)));
#define OFF034 OFF034
extern volatile uint32_t   OFF034 __attribute__((section("sfrs"), address(0xBF8105C8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF034bits_t;
extern volatile __OFF034bits_t OFF034bits __asm__ ("OFF034") __attribute__((section("sfrs"), address(0xBF8105C8)));
#define OFF035 OFF035
extern volatile uint32_t   OFF035 __attribute__((section("sfrs"), address(0xBF8105CC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF035bits_t;
extern volatile __OFF035bits_t OFF035bits __asm__ ("OFF035") __attribute__((section("sfrs"), address(0xBF8105CC)));
#define OFF036 OFF036
extern volatile uint32_t   OFF036 __attribute__((section("sfrs"), address(0xBF8105D0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF036bits_t;
extern volatile __OFF036bits_t OFF036bits __asm__ ("OFF036") __attribute__((section("sfrs"), address(0xBF8105D0)));
#define OFF037 OFF037
extern volatile uint32_t   OFF037 __attribute__((section("sfrs"), address(0xBF8105D4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF037bits_t;
extern volatile __OFF037bits_t OFF037bits __asm__ ("OFF037") __attribute__((section("sfrs"), address(0xBF8105D4)));
#define OFF038 OFF038
extern volatile uint32_t   OFF038 __attribute__((section("sfrs"), address(0xBF8105D8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF038bits_t;
extern volatile __OFF038bits_t OFF038bits __asm__ ("OFF038") __attribute__((section("sfrs"), address(0xBF8105D8)));
#define OFF039 OFF039
extern volatile uint32_t   OFF039 __attribute__((section("sfrs"), address(0xBF8105DC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF039bits_t;
extern volatile __OFF039bits_t OFF039bits __asm__ ("OFF039") __attribute__((section("sfrs"), address(0xBF8105DC)));
#define OFF040 OFF040
extern volatile uint32_t   OFF040 __attribute__((section("sfrs"), address(0xBF8105E0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF040bits_t;
