MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECH064/mcu.h
extern volatile __OFF040bits_t OFF040bits __asm__ ("OFF040") __attribute__((section("sfrs"), address(0xBF8105E0)));
#define OFF041 OFF041
extern volatile uint32_t   OFF041 __attribute__((section("sfrs"), address(0xBF8105E4)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF041bits_t;
extern volatile __OFF041bits_t OFF041bits __asm__ ("OFF041") __attribute__((section("sfrs"), address(0xBF8105E4)));
#define OFF042 OFF042
extern volatile uint32_t   OFF042 __attribute__((section("sfrs"), address(0xBF8105E8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF042bits_t;
extern volatile __OFF042bits_t OFF042bits __asm__ ("OFF042") __attribute__((section("sfrs"), address(0xBF8105E8)));
#define OFF043 OFF043
extern volatile uint32_t   OFF043 __attribute__((section("sfrs"), address(0xBF8105EC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF043bits_t;
extern volatile __OFF043bits_t OFF043bits __asm__ ("OFF043") __attribute__((section("sfrs"), address(0xBF8105EC)));
#define OFF044 OFF044
extern volatile uint32_t   OFF044 __attribute__((section("sfrs"), address(0xBF8105F0)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF044bits_t;
extern volatile __OFF044bits_t OFF044bits __asm__ ("OFF044") __attribute__((section("sfrs"), address(0xBF8105F0)));
#define OFF046 OFF046
extern volatile uint32_t   OFF046 __attribute__((section("sfrs"), address(0xBF8105F8)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF046bits_t;
extern volatile __OFF046bits_t OFF046bits __asm__ ("OFF046") __attribute__((section("sfrs"), address(0xBF8105F8)));
#define OFF047 OFF047
extern volatile uint32_t   OFF047 __attribute__((section("sfrs"), address(0xBF8105FC)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF047bits_t;
extern volatile __OFF047bits_t OFF047bits __asm__ ("OFF047") __attribute__((section("sfrs"), address(0xBF8105FC)));
#define OFF048 OFF048
extern volatile uint32_t   OFF048 __attribute__((section("sfrs"), address(0xBF810600)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF048bits_t;
extern volatile __OFF048bits_t OFF048bits __asm__ ("OFF048") __attribute__((section("sfrs"), address(0xBF810600)));
#define OFF049 OFF049
extern volatile uint32_t   OFF049 __attribute__((section("sfrs"), address(0xBF810604)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF049bits_t;
extern volatile __OFF049bits_t OFF049bits __asm__ ("OFF049") __attribute__((section("sfrs"), address(0xBF810604)));
#define OFF050 OFF050
extern volatile uint32_t   OFF050 __attribute__((section("sfrs"), address(0xBF810608)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF050bits_t;
extern volatile __OFF050bits_t OFF050bits __asm__ ("OFF050") __attribute__((section("sfrs"), address(0xBF810608)));
#define OFF051 OFF051
extern volatile uint32_t   OFF051 __attribute__((section("sfrs"), address(0xBF81060C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF051bits_t;
extern volatile __OFF051bits_t OFF051bits __asm__ ("OFF051") __attribute__((section("sfrs"), address(0xBF81060C)));
#define OFF052 OFF052
extern volatile uint32_t   OFF052 __attribute__((section("sfrs"), address(0xBF810610)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF052bits_t;
extern volatile __OFF052bits_t OFF052bits __asm__ ("OFF052") __attribute__((section("sfrs"), address(0xBF810610)));
#define OFF053 OFF053
extern volatile uint32_t   OFF053 __attribute__((section("sfrs"), address(0xBF810614)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF053bits_t;
extern volatile __OFF053bits_t OFF053bits __asm__ ("OFF053") __attribute__((section("sfrs"), address(0xBF810614)));
#define OFF054 OFF054
extern volatile uint32_t   OFF054 __attribute__((section("sfrs"), address(0xBF810618)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF054bits_t;
extern volatile __OFF054bits_t OFF054bits __asm__ ("OFF054") __attribute__((section("sfrs"), address(0xBF810618)));
#define OFF055 OFF055
extern volatile uint32_t   OFF055 __attribute__((section("sfrs"), address(0xBF81061C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF055bits_t;
extern volatile __OFF055bits_t OFF055bits __asm__ ("OFF055") __attribute__((section("sfrs"), address(0xBF81061C)));
#define OFF056 OFF056
extern volatile uint32_t   OFF056 __attribute__((section("sfrs"), address(0xBF810620)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF056bits_t;
extern volatile __OFF056bits_t OFF056bits __asm__ ("OFF056") __attribute__((section("sfrs"), address(0xBF810620)));
#define OFF057 OFF057
extern volatile uint32_t   OFF057 __attribute__((section("sfrs"), address(0xBF810624)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF057bits_t;
extern volatile __OFF057bits_t OFF057bits __asm__ ("OFF057") __attribute__((section("sfrs"), address(0xBF810624)));
#define OFF059 OFF059
extern volatile uint32_t   OFF059 __attribute__((section("sfrs"), address(0xBF81062C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF059bits_t;
extern volatile __OFF059bits_t OFF059bits __asm__ ("OFF059") __attribute__((section("sfrs"), address(0xBF81062C)));
#define OFF060 OFF060
extern volatile uint32_t   OFF060 __attribute__((section("sfrs"), address(0xBF810630)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF060bits_t;
extern volatile __OFF060bits_t OFF060bits __asm__ ("OFF060") __attribute__((section("sfrs"), address(0xBF810630)));
#define OFF061 OFF061
extern volatile uint32_t   OFF061 __attribute__((section("sfrs"), address(0xBF810634)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF061bits_t;
extern volatile __OFF061bits_t OFF061bits __asm__ ("OFF061") __attribute__((section("sfrs"), address(0xBF810634)));
#define OFF062 OFF062
extern volatile uint32_t   OFF062 __attribute__((section("sfrs"), address(0xBF810638)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF062bits_t;
extern volatile __OFF062bits_t OFF062bits __asm__ ("OFF062") __attribute__((section("sfrs"), address(0xBF810638)));
#define OFF063 OFF063
extern volatile uint32_t   OFF063 __attribute__((section("sfrs"), address(0xBF81063C)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF063bits_t;
extern volatile __OFF063bits_t OFF063bits __asm__ ("OFF063") __attribute__((section("sfrs"), address(0xBF81063C)));
#define OFF064 OFF064
extern volatile uint32_t   OFF064 __attribute__((section("sfrs"), address(0xBF810640)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF064bits_t;
extern volatile __OFF064bits_t OFF064bits __asm__ ("OFF064") __attribute__((section("sfrs"), address(0xBF810640)));
#define OFF065 OFF065
extern volatile uint32_t   OFF065 __attribute__((section("sfrs"), address(0xBF810644)));
typedef struct {
  uint32_t :1;
  uint32_t VOFF:17;
} __OFF065bits_t;
