MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024ECH064/mcu.h
#define _IEC4_U3EIE_POSITION                     0x0000001D
#define _IEC4_U3EIE_MASK                         0x20000000
#define _IEC4_U3EIE_LENGTH                       0x00000001

#define _IEC4_U3RXIE_POSITION                    0x0000001E
#define _IEC4_U3RXIE_MASK                        0x40000000
#define _IEC4_U3RXIE_LENGTH                      0x00000001

#define _IEC4_U3TXIE_POSITION                    0x0000001F
#define _IEC4_U3TXIE_MASK                        0x80000000
#define _IEC4_U3TXIE_LENGTH                      0x00000001

#define _IEC4_w_POSITION                         0x00000000
#define _IEC4_w_MASK                             0xFFFFFFFF
#define _IEC4_w_LENGTH                           0x00000020

#define _IEC5_I2C3BIE_POSITION                   0x00000000
#define _IEC5_I2C3BIE_MASK                       0x00000001
#define _IEC5_I2C3BIE_LENGTH                     0x00000001

#define _IEC5_I2C3SIE_POSITION                   0x00000001
#define _IEC5_I2C3SIE_MASK                       0x00000002
#define _IEC5_I2C3SIE_LENGTH                     0x00000001

#define _IEC5_I2C3MIE_POSITION                   0x00000002
#define _IEC5_I2C3MIE_MASK                       0x00000004
#define _IEC5_I2C3MIE_LENGTH                     0x00000001

#define _IEC5_SPI4EIE_POSITION                   0x00000003
#define _IEC5_SPI4EIE_MASK                       0x00000008
#define _IEC5_SPI4EIE_LENGTH                     0x00000001

#define _IEC5_SPI4RXIE_POSITION                  0x00000004
#define _IEC5_SPI4RXIE_MASK                      0x00000010
#define _IEC5_SPI4RXIE_LENGTH                    0x00000001

#define _IEC5_SPI4TXIE_POSITION                  0x00000005
#define _IEC5_SPI4TXIE_MASK                      0x00000020
#define _IEC5_SPI4TXIE_LENGTH                    0x00000001

#define _IEC5_RTCCIE_POSITION                    0x00000006
#define _IEC5_RTCCIE_MASK                        0x00000040
#define _IEC5_RTCCIE_LENGTH                      0x00000001

#define _IEC5_FCEIE_POSITION                     0x00000007
#define _IEC5_FCEIE_MASK                         0x00000080
#define _IEC5_FCEIE_LENGTH                       0x00000001

#define _IEC5_PREIE_POSITION                     0x00000008
#define _IEC5_PREIE_MASK                         0x00000100
#define _IEC5_PREIE_LENGTH                       0x00000001

#define _IEC5_SQI1IE_POSITION                    0x00000009
#define _IEC5_SQI1IE_MASK                        0x00000200
#define _IEC5_SQI1IE_LENGTH                      0x00000001

#define _IEC5_U4EIE_POSITION                     0x0000000A
#define _IEC5_U4EIE_MASK                         0x00000400
#define _IEC5_U4EIE_LENGTH                       0x00000001

#define _IEC5_U4RXIE_POSITION                    0x0000000B
#define _IEC5_U4RXIE_MASK                        0x00000800
#define _IEC5_U4RXIE_LENGTH                      0x00000001

#define _IEC5_U4TXIE_POSITION                    0x0000000C
#define _IEC5_U4TXIE_MASK                        0x00001000
#define _IEC5_U4TXIE_LENGTH                      0x00000001

#define _IEC5_I2C4BIE_POSITION                   0x0000000D
#define _IEC5_I2C4BIE_MASK                       0x00002000
#define _IEC5_I2C4BIE_LENGTH                     0x00000001

#define _IEC5_I2C4SIE_POSITION                   0x0000000E
#define _IEC5_I2C4SIE_MASK                       0x00004000
#define _IEC5_I2C4SIE_LENGTH                     0x00000001

#define _IEC5_I2C4MIE_POSITION                   0x0000000F
#define _IEC5_I2C4MIE_MASK                       0x00008000
#define _IEC5_I2C4MIE_LENGTH                     0x00000001

#define _IEC5_U5EIE_POSITION                     0x00000013
#define _IEC5_U5EIE_MASK                         0x00080000
#define _IEC5_U5EIE_LENGTH                       0x00000001

#define _IEC5_U5RXIE_POSITION                    0x00000014
#define _IEC5_U5RXIE_MASK                        0x00100000
#define _IEC5_U5RXIE_LENGTH                      0x00000001

#define _IEC5_U5TXIE_POSITION                    0x00000015
#define _IEC5_U5TXIE_MASK                        0x00200000
#define _IEC5_U5TXIE_LENGTH                      0x00000001

#define _IEC5_I2C5BIE_POSITION                   0x00000016
#define _IEC5_I2C5BIE_MASK                       0x00400000
#define _IEC5_I2C5BIE_LENGTH                     0x00000001

#define _IEC5_I2C5SIE_POSITION                   0x00000017
#define _IEC5_I2C5SIE_MASK                       0x00800000
#define _IEC5_I2C5SIE_LENGTH                     0x00000001

#define _IEC5_I2C5MIE_POSITION                   0x00000018
#define _IEC5_I2C5MIE_MASK                       0x01000000
#define _IEC5_I2C5MIE_LENGTH                     0x00000001

#define _IEC5_U6EIE_POSITION                     0x0000001C
#define _IEC5_U6EIE_MASK                         0x10000000
#define _IEC5_U6EIE_LENGTH                       0x00000001

#define _IEC5_U6RXIE_POSITION                    0x0000001D
#define _IEC5_U6RXIE_MASK                        0x20000000
#define _IEC5_U6RXIE_LENGTH                      0x00000001

#define _IEC5_U6TXIE_POSITION                    0x0000001E
#define _IEC5_U6TXIE_MASK                        0x40000000
#define _IEC5_U6TXIE_LENGTH                      0x00000001

#define _IEC5_w_POSITION                         0x00000000
#define _IEC5_w_MASK                             0xFFFFFFFF
#define _IEC5_w_LENGTH                           0x00000020

#define _IPC0_CTIS_POSITION                      0x00000000
#define _IPC0_CTIS_MASK                          0x00000003
#define _IPC0_CTIS_LENGTH                        0x00000002

#define _IPC0_CTIP_POSITION                      0x00000002
#define _IPC0_CTIP_MASK                          0x0000001C
#define _IPC0_CTIP_LENGTH                        0x00000003

#define _IPC0_CS0IS_POSITION                     0x00000008
#define _IPC0_CS0IS_MASK                         0x00000300
#define _IPC0_CS0IS_LENGTH                       0x00000002

#define _IPC0_CS0IP_POSITION                     0x0000000A
#define _IPC0_CS0IP_MASK                         0x00001C00
#define _IPC0_CS0IP_LENGTH                       0x00000003

